FI/Paikkatilanne/Integraatiopalvelu_RAVA-indeksi_Palvelukuvaus_1.0.xml

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="RavaPointsService" targetNamespace="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="urn:Tieto.HCW.EIS.PaikkatilanneService.ServiceContracts" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="urn:Tieto.HCW.EIS.PaikkatilanneService.ServiceContracts"><xs:import namespace="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService"/><xs:element name="RavaPointsRequest"><xs:complexType><xs:sequence><xs:element minOccurs="0" ref="q1:MessageHeader" xmlns:q1="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService"/><xs:element minOccurs="0" ref="q2:Common" xmlns:q2="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService"/><xs:element minOccurs="0" ref="q3:Rava" xmlns:q3="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetRavaPointsDataResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" ref="q4:AcknowledgeRequestStatus" xmlns:q4="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService"/><xs:element minOccurs="0" ref="q5:MessageHeader" xmlns:q5="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService"/><xs:element minOccurs="0" ref="q6:RavaPoints" xmlns:q6="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"><xs:complexType name="MessageHeader"><xs:sequence><xs:element minOccurs="0" name="CharacterSet" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="DataServiceURL" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="MessageID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ReceiverApplication" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ReceiverID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="SenderApplication" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="SenderID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="TransactionID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="UserLanguageCode" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="VersionNumber" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="MessageHeader" nillable="true" type="tns:MessageHeader"/><xs:complexType name="Common"><xs:sequence><xs:element minOccurs="0" name="ContractKey" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="UserId" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CallingSystem" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CallingUserId" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="Common" nillable="true" type="tns:Common"/><xs:complexType name="AcknowledgeRequestStatus"><xs:sequence><xs:element minOccurs="0" name="ErrorMessage" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ErrorType" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="HasOperationFailed" type="xs:boolean"/></xs:sequence></xs:complexType><xs:element name="AcknowledgeRequestStatus" nillable="true" type="tns:AcknowledgeRequestStatus"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:import namespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.PaikkatilanneService.DataContracts"/><xs:element name="MessageHeader" nillable="true" type="q1:MessageHeader" xmlns:q1="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:element name="Common" nillable="true" type="q2:Common" xmlns:q2="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:element name="Rava" nillable="true" type="q3:RavaReq" xmlns:q3="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.PaikkatilanneService.DataContracts"/><xs:element name="AcknowledgeRequestStatus" nillable="true" type="q4:AcknowledgeRequestStatus" xmlns:q4="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:element name="RavaPoints" nillable="true" type="q5:RavaPoints" xmlns:q5="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.PaikkatilanneService.DataContracts"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.PaikkatilanneService.DataContracts" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.PaikkatilanneService.DataContracts"><xs:complexType name="RavaReq"><xs:sequence><xs:element minOccurs="0" name="Timestamp" type="xs:dateTime"/></xs:sequence></xs:complexType><xs:element name="RavaReq" nillable="true" type="tns:RavaReq"/><xs:complexType name="RavaPoints"><xs:sequence><xs:element minOccurs="0" name="Rava" nillable="true" type="tns:ArrayOfRava"/><xs:element minOccurs="0" name="Timestamp" type="xs:dateTime"/></xs:sequence></xs:complexType><xs:element name="RavaPoints" nillable="true" type="tns:RavaPoints"/><xs:complexType name="ArrayOfRava"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="Rava" nillable="true" type="tns:Rava"/></xs:sequence></xs:complexType><xs:element name="ArrayOfRava" nillable="true" type="tns:ArrayOfRava"/><xs:complexType name="Rava"><xs:sequence><xs:element minOccurs="0" name="PatientData" nillable="true" type="tns:PatientData"/><xs:element minOccurs="0" name="Points" type="xs:double"/><xs:element minOccurs="0" name="EvaluationDate" nillable="true" type="xs:dateTime"/><xs:element minOccurs="0" name="EfficaUser" nillable="true" type="tns:EfficaUser"/></xs:sequence></xs:complexType><xs:element name="Rava" nillable="true" type="tns:Rava"/><xs:complexType name="PatientData"><xs:sequence><xs:element name="SSN" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="FamilyName" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="GivenNames" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="PatientData" nillable="true" type="tns:PatientData"/><xs:complexType name="EfficaUser"><xs:sequence><xs:element minOccurs="0" name="EfficaUsename" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="EfficaFamilyName" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="EfficaGivenNames" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="EfficaUser" nillable="true" type="tns:EfficaUser"/></xs:schema></wsdl:types><wsdl:message name="RavaPointsRequest"><wsdl:part name="parameters" element="q1:RavaPointsRequest" xmlns:q1="urn:Tieto.HCW.EIS.PaikkatilanneService.ServiceContracts"/></wsdl:message><wsdl:message name="GetRavaPointsResponse"><wsdl:part name="parameters" element="q2:GetRavaPointsDataResponse" xmlns:q2="urn:Tieto.HCW.EIS.PaikkatilanneService.ServiceContracts"/></wsdl:message><wsdl:portType name="IRavaPointsService"><wsdl:operation name="GetRavaPoints"><wsdl:input wsaw:Action="urn:Tieto.HCW.Tieto.HCW.EIS.PaikkatilanneService.WCFService.GetRavaPoints" name="RavaPointsRequest" message="tns:RavaPointsRequest"/><wsdl:output wsaw:Action="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService/IRavaPointsService/GetRavaPointsResponse" name="GetRavaPointsResponse" message="tns:GetRavaPointsResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IRavaPointsService" type="tns:IRavaPointsService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="GetRavaPoints"><soap:operation soapAction="urn:Tieto.HCW.Tieto.HCW.EIS.PaikkatilanneService.WCFService.GetRavaPoints" style="document"/><wsdl:input name="RavaPointsRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="GetRavaPointsResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="RavaPointsService"><wsdl:port name="BasicHttpBinding_IRavaPointsService" binding="tns:BasicHttpBinding_IRavaPointsService"><soap:address location="http://localhost:49795/RavaPointsService.svc"/></wsdl:port></wsdl:service></wsdl:definitions>