FI/Paikkatilanne/Integraatiopalvelu_RAVA-indeksi_Esimerkkisanoma_RavaPoints_Request_1.0.txt


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Tieto.HCW.EIS.PaikkatilanneService.ServiceContracts" xmlns:urn1="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService" xmlns:tiet="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon" xmlns:tiet1="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.PaikkatilanneService.DataContracts">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:RavaPointsRequest>
         <urn1:MessageHeader>
            <tiet:MessageID>?</tiet:MessageID>
            <tiet:TransactionID>?</tiet:TransactionID>
            <tiet:SenderID>?</tiet:SenderID>
            <tiet:SenderApplication>?</tiet:SenderApplication>
            <tiet:ReceiverID>?</tiet:ReceiverID>
            <tiet:ReceiverApplication>?</tiet:ReceiverApplication>
            <tiet:CharacterSet>?</tiet:CharacterSet>
            <tiet:DataServiceURL>?</tiet:DataServiceURL>
            <tiet:UserLanguageCode>?</tiet:UserLanguageCode>
            <tiet:VersionNumber>?</tiet:VersionNumber>
         </urn1:MessageHeader>
         <urn1:Common>
            <tiet:ContractKey>5B23C19F-8A99-39AB-823E-BE0A9877BB21</tiet:ContractKey>
            <tiet:UserId>?</tiet:UserId>
            <tiet:CallingSystem>Potikka</tiet:CallingSystem>
            <tiet:CallingUserId>?</tiet:CallingUserId>
         </urn1:Common>
         <urn1:Rava>
            <tiet1:Timestamp>2013-05-13</tiet1:Timestamp>
         </urn1:Rava>
      </urn:RavaPointsRequest>
   </soapenv:Body>
</soapenv:Envelope>